run/buoyantHumidPimpleSTParcelFoam/freeFall/constant/cloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      cloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// The centre of the top cell of the column.  The tracking releases its
// droplet at the same point, which is what makes the fall distance -- and so
// the moment the floor is reached -- comparable.

(
    (0.5 0.5 9.5)
)

// ************************************************************************* //
