run/buoyantHumidPimpleSTParcelFoam/freeFall/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// The mesh is one cell across in x and y, so only a split along the column
// decomposes; the rank count must also be one the tracking has a Lagrangian
// decomposition for
numberOfSubdomains  2;

method          simple;

coeffs
{
    n           (1 1 2);
}

// ************************************************************************* //
