run/buoyantHumidPimpleSTParcelFoam/freeFall/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir
runApplication blockMesh
runApplication buoyantHumidPimpleSTParcelFoam
runApplication buoyantHumidPimpleParcelFoam

# collect the linear momentum of the cloud.  The reference reports the vector,
# of which the third component is the falling direction; the tracking library
# reports that component alone, so the two are grepped by different patterns
grep '^    Linear momentum  ' log.buoyantHumidPimpleParcelFoam >momentumZ_OF.csv
grep '^    Linear momentum z' log.buoyantHumidPimpleSTParcelFoam >momentumZ_ST.csv

# collect the mass in the system, which stays constant on both sides as long
# as the evaporation is off
grep 'Current mass in system' log.buoyantHumidPimpleParcelFoam >H2OPMass_OF.csv
grep 'Current mass in system' log.buoyantHumidPimpleSTParcelFoam >H2OPMass_ST.csv

#------------------------------------------------------------------------------
